{"rating": "Rating: 2", "name": "drugs-shopper", "img_url": "http://rznvg5sjacavz5kpshrq4urm75xzruha6iiyuggidnioo5ztvwdfroyd.onion/images/catalog/small/1717a68fbd69f6711ae008fde5272df8.jpg", "description": "Description:\nShipping\nYour order will be shipped within 24 hours after ordering. Its always vacuum sealed with decoy. Every package is checked twice before shipping. Shipping to the EU is always possible whatever quantity. We don’t ship to the Netherlands.\nWe sometimes send parcels using tracking even if the customer has selected ‘regular shipping’. This is to prevent scammers trying to claim an undelivered parcel. We don’t do this with every parcel mind you and we only using the tracking information in case of a dispute.\nPlease keep in mind that if you place an order during the weekend it will only be shipped on Monday. Take that into account when calculating the delivery time. Also, during holidays postal services are overwhelmed with parcels and staff shortage so there will always be a delay of a few days in delivery time.\nWe might mark the order as shipped even though we might actually send it a day later. This is to prevent LE from trying to identify our delivery pattern.\nTracking information is available upon request. It’s imporant to remember that we can delay the release of the tracking code if we think it might jeopardize our security protocols or we might not release it at all, only in case of a dispute.\nWe cannot ship domestically (NL) using tracking code due to OPSEC protocols. We don’t do face to face or pick-up deliveries either, only through post.\nWe advise customers from Germany to use only the Regular Shipping option because with the Tracking code Europe option they might encounter problems with the Hermes Group (stealing parcels, failed deliveries, etc). The Regular Shipping option to Germany has 100% success rate so don’t worry.\n \nhttp://ofhusuznhfnmtli3l6r3xizo27zoymka77dzehkeib56fhuxrcloy2id.onion/\nhttp://bnkgnccepweowy5oqxuop2w576rdlyerqtfi2qh3slxrqh4towrlcead.onion/\n ", "price": "Price: 10$", "contacts": "Contacts: drugsshopper@mail2tor.com", "tags": "Tags: afghan kush - cannabis, alaskan thunder fuck, pure skinny fishscale cocaine, columbia cocaine", "web": null}
